{
    "summary": "I'm a undergraduate student at Northeastern University studying CS & Math. I'm broadly interested in researching applied mathematics and machine learning in the context of biochemistry and bioengineering.",
    "education": [
        {
          "institution": "Northeastern University — Boston, Massachusetts",
          "degree": "BSc in Computer Science and Mathematics",
          "dates": "September 2022 - May 2026",
          "grade": "3.9/4.0",
          "honors": ["Honors Program", "Dean's List", "REU Grant", "MathWorks DMSB Scholarship", "PEAK Research Award"],
          "courses": ["Object-Oriented Design", "Algorithms and Data Structures", "Linear Algebra", "Advanced Probability and Statistics", "Differential Equations"]
        },
        {
          "institution": "Markham College — Lima, Peru",
          "degree": "IB Diploma",
          "dates": "March 2018 - December 2021",
          "grade": "41/45",
          "courses": ["HL Mathematics AI", "HL Computer Science", "HL Physics", "SL Philosophy", "SL Spanish A Literature", "SL English A Literature"]
        }
    ],
    "workExperience": [
        {
            "title": "Computational Modeling Co-op",
            "companyName": "Montai Therapeutics",
            "location": "Cambridge, Massachusetts",
            "dates": "January 2024 - Present",
            "assets": {},
            "description": [
                "Contributed to bioactivity machine learning model development using PyTorch, incorporated weighting and ensembling features and performed detailed analysis demonstrating performance improvement over original model.", 
                "Built interpretable machine learning models to predict druglikeness in compounds, wrangling data from public and proprietary databases. Iteratively improved model design through continuous feedback and ablation experiments.",
                "Worked on cross-team engineering efforts in streamlining model training, prediction and evaluation pipelines, and built Streamlit apps that queries models and visualizes results to increase accesibility of models to biologically focused teams."
            ]
        },
        {
            "title": "Undergraduate Researcher",
            "companyName": "Programming Research Laboratory (NUPRL)",
            "location": "Boston, Massachusetts",
            "dates": "January 2023 - Present",
            "assets": {
                "Benchmark": "https://github.com/nuprl/CanItEdit",
                "Paper": "https://arxiv.org/abs/2312.12450"
            },
            "description": [
                "Contributed to CanItEdit, a code-editing benchmark that evaluates Large Language Model’s performance on sophisticated and diverse code editing tasks that demand domain-specific knowledge.", 
                "Wrote code to evaluate open and closed source models using our benchmark problems and metrics such as Pass@1.",
                "Co-authored the CanItEdit paper and presented at LLM4Code (ICSE Workshop). The paper is also submission to COLM."
            ]
        },
        {
            "title": "Teaching Assistant",
            "companyName": "Khoury College of Computer Sciences",
            "location": "Boston, Massachusetts",
            "dates": "September 2023 - December 2023",
            "assets": {
            },
            "description": [
                "Directed weekly lab sessions, wrote reference solutions and test suites, hosted office hours and graded weekly homework"
            ]
        },
        {
            "title": "Mathematics Grader",
            "companyName": "Northeastern University",
            "location": "Boston, Massachusetts",
            "dates": "September 2023 - December 2023",
            "assets": {
            },
            "description": [
                "Graded students' weekly quizzes and provided feedback for improvements."
            ]
        },
        {
            "title": "Undergraduate Researcher",
            "companyName": "Research Experience for Undergraduates (REU)",
            "location": "Boston, Massachusetts",
            "dates": "May 2023 - June 2023",
            "assets": {
            },
            "description": [
                "Researched Convolutional Neural Networks (CNNs) and potential extensions to current architectures through group theory, which adds other forms of equivariance properties to standard CNN models.",
                "Collaborated with fellow researchers to code, train and test CNN architectures such as ResNet and GoogLeNet in Python with PyTorch on the CIFAR10 dataset, which consists of 70K total images split into 10 classes.", 
                "Developed group equivariant neural networks that extends a normal CNN to be equivariant to rotations and reflections."
            ]
        }
    ],
    "projects": [
        {
            "name": "Personal Website",
            "date": "June 2024",
            "assets": {
                "Code": "https://github.com/luisa-li/site"
            },
            "description": ["A website built using HTML, CSS and JavaScript, hosting a web version of my resume, and other bits and bobs!"]
        },
        {
            "name": "MD Simulation of Argon Gas",
            "date": "June 2024",
            "assets": {
                "Code": "https://github.com/luisa-li/COMBINE/blob/main/argon_simulation.py"
            },
            "description": ["A molecular dynamics simulation of argon gas in 3D space, obeying the basic kinematic equations, and moving under the influence of the Lennard-Jones force.", "Code written in Python, animated using Matplotlib, and vector operations optimized with Numpy."]
        },
        {
            "name": "GenderSender",
            "date": "October 2023",
            "assets": {
                "Code": "https://github.com/elizabeth-mcdowell/gendersender"
            },
            "description": ["Created a website that helps users edit their emails to be either more direct or more polite, with the idea to subvert the gender expectation that women should email differently to men.", "The application is built with React, Typescript and CSS in the frontend, Python, FastAPI and OpenAI’s API in the backend. This project won Best Overall Hack at Hack the Patriarchy Hackathon."]
        },
        {
            "name": "SpotCheck",
            "date": "February 2023",
            "assets": {
                "Code": "https://github.com/SpaceRage/AIHackathon"
            },
            "description": ["Created a machine learning model to classify skin cancer lesions with special emphasis on reducing discrimination based on skin tone in similar models. The project won Best Overall Project at the Responsible AI Hackathon."]
        }
    ]
}